In [2]:
import pandas as pd

In [75]:
# 조건필터링
data = {
    '이름': ['홍길동', '김철수', '이영희', '박민수'],
    '점수': [80, 70, 95, 70],
    '반': [2, 1, 1, 2]
}
df = pd.DataFrame(data)

# and 
mask=(df["반"]==1)&(df["점수"]>=80)
print(df[mask],"\n")

# or
mask=(df["반"]==2)|(df["점수"]>=90)
print(df[mask],"\n")

# 간결하게 
mask=df["이름"].isin(["홍길동","박민수"]) #이름 안에 길동, 민수있느냐. 이름에 길동민수 있는거만 트루
print(df[mask]) # 트루만 필터링해서 출력

    이름  점수  반
2  이영희  95  1

    이름  점수  반
0  홍길동  80  2
2  이영희  95  1
3  박민수  70  2

    이름  점수  반
0  홍길동  80  2
3  박민수  70  2

In [76]:
mask=(df["반"]==2)|(df["점수"]>=90)
df2=df[mask]
print(df2,"\n")

df2=df2.reset_index() # 인덱스가 꼬였을 때 리셋인덱스를 사용한다.
print(df2,"\n")

df2=df2.reset_index(drop=True) # 기존인덱스를 삭제
print(df2)

    이름  점수  반
0  홍길동  80  2
2  이영희  95  1
3  박민수  70  2

   index   이름  점수  반
0      0  홍길동  80  2
1      2  이영희  95  1
2      3  박민수  70  2

   index   이름  점수  반
0      0  홍길동  80  2
1      2  이영희  95  1
2      3  박민수  70  2

In [77]:
df=pd.DataFrame({
    '이름':['민준','서연','지후','서준','지민'],
    '점수':[78,92,85,60,88],
    '반':[1,2,1,2,1]
})

#1
print(f"80점이상\n{df[df["점수"] > 80]}\n")
#2
mask=(df["반"]==1) & (df["점수"]>=85)
print(f"1반 중 85 이상만\n{df[mask]}\n")
#3
mask=df["이름"].isin(["서연","지민"])
print(f"서연 혹은 지민\n{df[mask]}\n")
#4
df_new=df[mask]
df_new=df_new.reset_index(drop=True)
print(f"인덱스 재정렬\n{df_new}\n")
#5
mask=(df["반"]==2) | (df["점수"]<80)
print(f"2반 혹은 80미만\n{df[mask]}\n")
#6
df_new = df[mask]
df_new = df_new[df_new["점수"] >= 70]
df_new = df_new.reset_index(drop=True)
print(f"인덱스 재정렬\n{df_new}\n")

80점이상
   이름  점수  반
1  서연  92  2
2  지후  85  1
4  지민  88  1

1반 중 85 이상만
   이름  점수  반
2  지후  85  1
4  지민  88  1

서연 혹은 지민
   이름  점수  반
1  서연  92  2
4  지민  88  1

인덱스 재정렬
   이름  점수  반
0  서연  92  2
1  지민  88  1

2반 혹은 80미만
   이름  점수  반
0  민준  78  1
1  서연  92  2
3  서준  60  2

인덱스 재정렬
   이름  점수  반
0  민준  78  1
1  서연  92  2

In [78]:
df = pd.DataFrame({
    '이름': ['김철수', '이영희', '박민수'],
    '국어': [90, 80, 70],
    '영어': [85, 78, 92]
})
df

    이름  국어  영어
0  김철수  90  85
1  이영희  80  78
2  박민수  70  92

In [79]:
# 같은 값 한번에 추가
df["반"]="1반" 
# 컬럼이 존재하면 수정, 없다면 추가
df

    이름  국어  영어   반
0  김철수  90  85  1반
1  이영희  80  78  1반
2  박민수  70  92  1반

In [80]:
# 조건문을 통한 추가
df["국어 합격여부"]=df["국어"]>=80
df

df["국어 합격여부"] = ["합격" if x >= 80 else "불합" for x in df["국어"]]
df

    이름  국어  영어   반 국어 합격여부
0  김철수  90  85  1반      합격
1  이영희  80  78  1반      합격
2  박민수  70  92  1반      불합

In [81]:
# 리스트/시리즈를 통한 열추가
df["학번"]=[101,102,103]
df

    이름  국어  영어   반 국어 합격여부   학번
0  김철수  90  85  1반      합격  101
1  이영희  80  78  1반      합격  102
2  박민수  70  92  1반      불합  103

In [82]:
# 기존값 한번에 변경
df["영어"]=100
df

    이름  국어   영어   반 국어 합격여부   학번
0  김철수  90  100  1반      합격  101
1  이영희  80  100  1반      합격  102
2  박민수  70  100  1반      불합  103

In [83]:
# 시리즈 연산결과로 새열추가
df["총점"]=df["국어"]+df["영어"]
df

    이름  국어   영어   반 국어 합격여부   학번   총점
0  김철수  90  100  1반      합격  101  190
1  이영희  80  100  1반      합격  102  180
2  박민수  70  100  1반      불합  103  170

In [84]:
# 열삭지
df2=df.drop("국어 합격여부",axis=1) # axis 1로 열만 삭제한다
df2

    이름  국어   영어   반   학번   총점
0  김철수  90  100  1반  101  190
1  이영희  80  100  1반  102  180
2  박민수  70  100  1반  103  170

In [85]:
# 여러 열 삭제
df3=df2.drop(["총점","학번"],axis=1)
df3

    이름  국어   영어   반
0  김철수  90  100  1반
1  이영희  80  100  1반
2  박민수  70  100  1반

In [86]:
# inplace 원본에서 삭제
df.drop("반",axis=1,inplace=True)
df

    이름  국어   영어 국어 합격여부   학번   총점
0  김철수  90  100      합격  101  190
1  이영희  80  100      합격  102  180
2  박민수  70  100      불합  103  170

In [87]:
# 기타 삭제방법
del df["총점"]
df
# del 키워드도 사용가능

    이름  국어   영어 국어 합격여부   학번
0  김철수  90  100      합격  101
1  이영희  80  100      합격  102
2  박민수  70  100      불합  103

In [90]:
deleted=df.pop("국어 합격여부")
deleted

0    합격
1    합격
2    불합
Name: 국어 합격여부, dtype: object

# 행 추가 수정 삭제

In [121]:
# 행추가 concat

df = pd.DataFrame({
    '이름': ['김철수', '이영희'],
    '나이': [23, 25]
})

new_rows = pd.DataFrame({
    '이름': ['박민수', '최지우'],
    '나이': [90, 22]
})

df = pd.concat([df, new_rows], ignore_index=True)
df

new_row = pd.DataFrame({'이름': ['박민수'], '나이': [27]})
df = pd.concat([df, new_row], ignore_index=True)
df

    이름  나이
0  김철수  23
1  이영희  25
2  박민수  90
3  최지우  22
4  박민수  27

In [99]:
# 행수정
df.loc[1]=["김영희",49]
df
# 1번에 대한 행 수정

    이름  나이
0  김철수  23
1  김영희  49
2  박민수  27
3  최지우  22
4  박민수  27

In [101]:
df.loc[0, "나이"]=90
df
# 0번째 행의 나이를 변경

    이름  나이
0  김철수  90
1  김영희  49
2  박민수  27
3  최지우  22
4  박민수  27

In [103]:
df.loc[1:3,"나이"]=85
df # 일괄적으로 나이변경

    이름  나이
0  김철수  90
1  김영희  85
2  박민수  85
3  최지우  85
4  박민수  27

In [107]:
df.loc[1:2,["이름","나이"]]=[["박심심",25],["김냄새",90]]
df
# 여러개를 변경

    이름  나이
0  김철수  90
1  박심심  25
2  김냄새  90
3  최지우  85
4  박민수  27

In [108]:
df2=df.drop(1)
df2
# 드랍의 기본 axis는 0이다

    이름  나이
0  김철수  90
2  김냄새  90
3  최지우  85
4  박민수  27

In [109]:
df2=df.drop(1).reset_index(drop=True)
df2

    이름  나이
0  김철수  90
1  김냄새  90
2  최지우  85
3  박민수  27

In [113]:
df3=df.drop([0,2])
df3

    이름  나이
1  박심심  25
3  최지우  85
4  박민수  27

In [123]:
df = df[df["나이"] >=30]
df
# 덮어쓰긔

    이름  나이
2  박민수  90

1. '수학' 점수 [95, 100, 88]을 새 열로 추가하세요.
2. 1번 문제의 DataFrame에서 '이름' 열을 삭제하세요.

In [136]:
df = pd.DataFrame({
'이름': ['김철수', '이영희', '박민수'],
'국어': [90, 80, 70]
})
#1
df["수학"]=[95,100,88]
print(df,"\n")
#2
del df["이름"]
print(df,"\n")

    이름  국어   수학
0  김철수  90   95
1  이영희  80  100
2  박민수  70   88

   국어   수학
0  90   95
1  80  100
2  70   88

3. 제품 'C', 가격 1500인 새 행을 추가하세요.
4. 3번 문제의 DataFrame에서 첫 번째 행(제품 'A')을 삭제하세요.

In [158]:
df = pd.DataFrame({
'제품': ['A', 'B'],
'가격': [1000, 2000]
})
#3
df = pd.concat([df, pd.DataFrame({'제품': ['C'], '가격': [1500]})],ignore_index=True)
print(df,"\n")
#4
df_drop=df.drop(0)
df=df_drop
print(df)

  제품    가격
0  A  1000
1  B  2000
2  C  1500

  제품    가격
1  B  2000
2  C  1500

5. '점수'가 80 미만인 행을 모두 삭제하세요.
6. '학년' 열(값은 모두 1)을 추가하세요.

In [151]:
df = pd.DataFrame({
'과목': ['국어', '영어', '수학'],
'점수': [85, 90, 78]
})
#5
df=df[df["점수"] >=80]
print(df,"\n")
#6
df["학년"]=1
print(df)

   과목  점수
0  국어  85
1  영어  90

   과목  점수  학년
0  국어  85   1
1  영어  90   1


7. 이름이 'C', 나이가 25, 키가 NaN(결측값)인 새 행을 추가하세요.
(단, '키'라는 새 열이 자동으로 추가되어야 함)

In [159]:
import numpy as np
df = pd.DataFrame({
'이름': ['A', 'B'],
'나이': [20, 22]
})
#7
df = pd.concat([df, pd.DataFrame({'이름': ['C'], '나이': [15], '키':[np.nan]})],ignore_index=True)
df

  이름  나이   키
0  A  20 NaN
1  B  22 NaN
2  C  15 NaN


8. 인원이 2명 이하인 행을 모두 삭제하고,
9. '평가' 열을 새로 추가해 모든 값을 '미정'으로 채우세요.

In [156]:
df = pd.DataFrame({
'부서': ['영업', '기획', '개발', '디자인'],
'인원': [3, 2, 5, 1]
})
#8
df=df[df["인원"] <=2]
print(df,"\n")
#9
df["평가"]="미정"
print(df)

    부서  인원
1   기획   2
3  디자인   1

    부서  인원  평가
1   기획   2  미정
3  디자인   1  미정

# 문자열 데이터 처리

In [5]:
import pandas as pd

data = {
    '이름': ['홍길동', '김철수', '이영희', '박민수'],
    '점수': [90, 70, 85, 95],
    '반': [2, 1, 1, 2]
}
df = pd.DataFrame(data)

# 값기준 정렬
df2=df.sort_values(by="점수").reset_index(drop=True) # 기본 오름차순
df2

    이름  점수  반
0  김철수  70  1
1  이영희  85  1
2  홍길동  90  2
3  박민수  95  2

In [9]:
# 내림차순 정렬
df3=df.sort_values("점수",ascending=False).reset_index(drop=True)
# 어센딩은 오름차순, 즉 펄스로 바꾸면 자동으로 디센딩
df3

    이름  점수  반
0  박민수  95  2
1  홍길동  90  2
2  이영희  85  1
3  김철수  70  1

In [15]:
# 반대로 정렬하고 점수대로 또 정렬하고싶다
df4=df.sort_values(["반","점수"],
                   ascending=[True,False]).reset_index(drop=True)
#반은 오름차, 점수는 내림차
df4

    이름  점수  반
0  이영희  85  1
1  김철수  70  1
2  박민수  95  2
3  홍길동  90  2

In [16]:
df.sort_values(["반","점수"],
                   ascending=[True,False],
                    inplace=True
                   )
#반은 오름차, 점수는 내림차
df.reset_index(drop=True) # 원본변경

    이름  점수  반
0  이영희  85  1
1  김철수  70  1
2  박민수  95  2
3  홍길동  90  2

In [26]:
# 인덱스 기준 정렬
df_shuffled=df.sample(frac=1,random_state=42) #시드값 42에 랜덤 인덕스 순서로 섞인 것을 저장
df_shuffled

df5=df_shuffled.sort_index()
df5

df6=df.sort_index(axis=1) #열 이름 기준 정렬(알파벳순)
df6

   반   이름  점수
2  1  이영희  85
1  1  김철수  70
3  2  박민수  95
0  2  홍길동  90

1. 주어진 DataFrame에서, score 컬럼 기준으로 오름차순 정렬한 결과를 출력하세요.
2. score 컬럼 기준 내림차순으로 정렬한 후, 정렬된 인덱스를 무시하고 0부터 재정렬한 결과를
출력하세요

In [33]:
df = pd.DataFrame({
'name': ['Alice', 'Bob', 'Charlie', 'David'],
'score': [88, 95, 70, 100]
})

df_asc=df.sort_values(["score"])
print(df_asc,"\n")
df_dsc=df.sort_values(["score"],ascending=False).reset_index(drop=True)
print(df_dsc)

      name  score
2  Charlie     70
0    Alice     88
1      Bob     95
3    David    100

      name  score
0    David    100
1      Bob     95
2    Alice     88
3  Charlie     70

3. 주어진 DataFrame에서,반(class) 기준 오름차순, 같은 반 내에서는 점수(score) 기준 내림차순으로 정렬한 결
과를 출력하세요.
4. 열(컬럼) 이름을 알파벳순으로 정렬해서 출력하세요.

In [37]:
df = pd.DataFrame({
'이름': ['가', '나', '다', '라', '마'],
'반': [2, 1, 1, 2, 1],
'점수': [90, 85, 80, 95, 85]
})
df_sort=df.sort_values(["반","점수"],
                   ascending=[True,False]).reset_index(drop=True)
print(df_sort)
df_sort_re=df_sort.sort_index(axis=1)
print(df_sort_re)

  이름  반  점수
0  나  1  85
1  마  1  85
2  다  1  80
3  라  2  95
4  가  2  90
   반 이름  점수
0  1  나  85
1  1  마  85
2  1  다  80
3  2  라  95
4  2  가  90

5. 인덱스 기준으로 오름차순 정렬한 결과를 출력하세요.
6. 인덱스 기준 내림차순 정렬, value 컬럼 기준 오름차순 정렬 두 가지 정렬 결과를 각각 출력하
세요.

In [42]:
df = pd.DataFrame({
'value': [10, 20, 30, 40]
}, index=[3, 1, 4, 2])

df_asc=df.sort_index()
print(df_asc,"\n")

df_dsc=df.sort_index(ascending=False)
print(df_dsc)

df_vasc=df.sort_values(by="value").reset_index(drop=True)
print(df_vasc)

   value
1     20
2     40
3     10
4     30

   value
4     30
3     10
2     40
1     20
   value
0     10
1     20
2     30
3     40

# groupby

집계를 만들어서 통계를 낼때 주로 사용

In [43]:
df = pd.DataFrame({
    'team': ['A', 'A', 'B', 'B', 'B', 'C'],
    'name': ['Kim', 'Lee', 'Park', 'Choi', 'Jung', 'Han'],
    'score': [90, 85, 80, 70, 95, 88]
})

In [59]:
# 단일 컬럼 기준 그룹화
grouped=df.groupby("team")
# 집계를 해줘야 한다

# 그룹 별로 스코어의 총 합
# A 팀의 스코어 총합: 175
# B 팀의 스코어 총합: 245... 
print(" 각 team 별로 score 합계가 보고싶어.")
result_sum=grouped["score"].sum()
print(result_sum)

# 평균
print("\n","각 team 별로 score의 평균치가 보고싶어.")
result_mean=grouped["score"].mean()
print(result_mean)

# 객수
print("\n","각 team 별로 score가 몇개인지 보고싶어.")
result_mean=grouped["score"].count()
print(result_mean)

 각 team 별로 score 합계가 보고싶어.
team
A    175
B    245
C     88
Name: score, dtype: int64

 각 team 별로 score의 평균치가 보고싶어.
team
A    87.500000
B    81.666667
C    88.000000
Name: score, dtype: float64

 각 team 별로 score가 몇개인지 보고싶어.
team
A    2
B    3
C    1
Name: score, dtype: int64

여러 컬럼 기준 그룹화

In [83]:
df2 = pd.DataFrame({
    'team': ['A', 'A', 'B', 'B', 'B', 'C'],
    'gender': ['M', 'F', 'F', 'M', 'M', 'F'],
    'score': [90, 85, 80, 70, 95, 88],
    'age':[20,20,30,30,50,60]
})

In [74]:
result = df2.groupby(["team", "gender"])["score"].mean()
result

team  gender
A     F         85.0
      M         90.0
B     F         80.0
      M         82.5
C     F         88.0
Name: score, dtype: float64

In [77]:
result = df2.groupby(["team"], as_index=False)["score"].sum()
result
# 그룹키가 인덱스로 설정된다.

  team  score
0    A    175
1    B    245
2    C     88

In [79]:
result = df2.groupby(["team"], as_index=False)["score"].agg(["sum","mean","count"])
result # 몽땅 넣어

  team  sum       mean  count
0    A  175  87.500000      2
1    B  245  81.666667      3
2    C   88  88.000000      1

In [86]:
result=df2.groupby("team").agg({
    "score":"mean",
    "age":"max"
})

result # 그룹별 여러 컬럼에 다른 집계 함수 적용

          score  age
team
A     87.500000   20
B     81.666667   50
C     88.000000   60

1. 각 학년(grade)별 평균 국어 점수(kor)를 구하세요.

In [115]:
df = pd.DataFrame({
'grade': [1, 2, 1, 2, 1, 3],
'name': ['Kim', 'Lee', 'Park', 'Choi', 'Jung', 'Han'],
'kor': [85, 78, 90, 92, 80, 75]
})

result=df.groupby(["grade"])["kor"].mean()
result

grade
1    85.0
2    85.0
3    75.0
Name: kor, dtype: float64

2. 아래 DataFrame에서 반(class)별, 과목(subject)별로 시험에 응시한 학생 수(count)와 평
균 점수(avg)를 구하세요.

In [120]:
df = pd.DataFrame({
    'class': [1, 1, 1, 2, 2, 2],
    'subject': ['Math', 'Math', 'Eng', 'Math', 'Eng', 'Eng'],
    'score': [80, 90, 85, 70, 95, 90]
})

result = df.groupby(['class', 'subject']).agg(
    count=('score', 'count'),
    avg=('score', 'mean')
).reset_index()

result

   class subject  count   avg
0      1     Eng      1  85.0
1      1    Math      2  85.0
2      2     Eng      2  92.5
3      2    Math      1  70.0

3. 아래 DataFrame에서 지역(region)별 판매자(seller)별로 판매액(sales)의 합계와 최대값
을 구하세요.

In [119]:
df = pd.DataFrame({
'region': ['Seoul', 'Seoul', 'Busan', 'Busan', 'Daegu'],
'seller': ['A', 'B', 'A', 'B', 'A'],
'sales': [100, 200, 150, 120, 130]
})

result=df.groupby(["region","seller"])["sales"].agg("sum","max")
result

region  seller
Busan   A         150
        B         120
Daegu   A         130
Seoul   A         100
        B         200
Name: sales, dtype: int64

4. 아래 DataFrame에서 팀(team)별, 포지션(position)별로 결측치(NaN)를 포함한 점수
(score)의 평균을 구하세요.

In [125]:
df = pd.DataFrame({
'team': ['A', 'A', 'B', 'B', 'A', 'B'],
'position': ['FW', 'DF', 'FW', 'DF', 'DF', 'FW'],
'score': [3, 2, None, 1, 4, 2]
})

result=df.groupby(["team","position"])["score"].mean()
result.reset_index()

  team position  score
0    A       DF    3.0
1    A       FW    3.0
2    B       DF    1.0
3    B       FW    2.0

5. 아래 DataFrame에서 부서(dept)별로 성별(gender)별 인원 수와, 총 연봉(salary) 합계를
구하세요

In [133]:
df = pd.DataFrame({
'dept': ['HR', 'HR', 'IT', 'IT', 'Sales', 'Sales'],
'gender': ['M', 'F', 'F', 'M', 'F', 'F'],
'salary': [3500, 3200, 4000, 4200, 3000, 3100]
})

# result=df.groupby(["dept","gender"])["salary"].agg(["count","sum"])

result=df.groupby(["dept","gender"]).agg(
    count=("salary","count"),
    total_salary=("salary","sum") # 컬럼명 지정
    )
result

              count  total_salary
dept  gender
HR    F           1          3200
      M           1          3500
IT    F           1          4000
      M           1          4200
Sales F           2          6100